ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Модели/АСМ_Модели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Модели</name>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Модификации/АСМ_Модификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АСМ_Модификации</name>
  <attributes>
    <name>ГодНачалаВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодОкончанияВыпуска</name>
    <type>
      <types>CatalogRef.АСМ_Годы</types>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.АСМ_Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.АСМ_Модели</types>
    </type>
  </attributes>
  <attributes>
    <name>Поколение</name>
    <type>
      <types>CatalogRef.АСМ_Поколения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТоплива</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТоплива</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПривода</name>
    <type>
      <types>CatalogRef.АСМ_ТипыПривода</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТрансмиссии</name>
    <type>
      <types>CatalogRef.АСМ_ТипыТрансмиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>Мощность</name>
    <type>
      <types>CatalogRef.АСМ_Мощности</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийОбъем</name>
    <type>
      <types>CatalogRef.АСМ_Объемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКузова</name>
    <type>
      <types>CatalogRef.АСМ_ТипыКузовов</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДверей</name>
    <type>
      <types>CatalogRef.АСМ_КоличествоДверей</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Комплектации</name>
    <attributes>
      <name>Комплектация</name>
      <type>
        <types>CatalogRef.АСМ_Комплектации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИнКар.АвтоСервисМагазин/src/Catalogs/АСМ_Модели/ManagerModule.bsl
//
//	Филимонов И.В.
//		+7 913 240 81 77
//		+7 905 084 20 06 (Telegram)
//		https://github.com/Shu-ler
//		
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция Поколения(Модель) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", Модель);
	Запрос.Текст = "ВЫБРАТЬ
				   |	АСМ_Поколения.Ссылка
				   |ИЗ
				   |	Справочник.АСМ_Поколения КАК АСМ_Поколения
				   |ГДЕ
				   |	АСМ_Поколения.Модель = &Модель
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	АСМ_Поколения.Наименование";

	Поколения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");

	Возврат Поколения;

КонецФункции

// Возвращает данные модификаций и комплектаций
// 
// Параметры:
//  Ссылка - СправочникСсылка.АСМ_Модели - Модель
// 
// Возвращаемое значение:
//  Структура - Опции отбора:
// * Агрегаты - ТаблицаЗначений - Объем и мощность двигателя, привод, тип трансмиссии
// * ТипыКузовов - ТаблицаЗначений - Типы кузовов, количество дверей
// * Комплектации - ТаблицаЗначений - Комплектации
// * Поколения - ТаблицаЗначений - Поколения
Функция ОпцииОтбора(Ссылка) Экспорт

	ОпцииОтбора = Новый Структура;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Модель", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	АСМ_Модификации.ТипТоплива КАК ТипТоплива,
				   |	АСМ_Модификации.ТипПривода КАК ТипПривода,
				   |	АСМ_Модификации.ТипТрансмиссии КАК ТипТрансмиссии,
				   |	АСМ_Модификации.Мощность КАК Мощность,
				   |	АСМ_Модификации.РабочийОбъем КАК РабочийОбъем,
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_Модификации.ТипПривода.Наименование + "", "" + АСМ_Модификации.ТипТрансмиссии.Наименование + "", "" +
				   |		АСМ_Модификации.ТипТоплива.Наименование + "" ("" + АСМ_Модификации.РабочийОбъем.Наименование + ""л/"" +
				   |		АСМ_Модификации.Мощность.Наименование + ""л.с.)"" КАК Расшифровка
				   |ИЗ
				   |	Справочник.АСМ_Модификации КАК АСМ_Модификации
				   |ГДЕ
				   |	АСМ_Модификации.Модель = &Модель
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	АСМ_Модификации.ТипКузова КАК ТипКузова,
				   |	АСМ_Модификации.КоличествоДверей КАК КоличествоДверей,
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_Модификации.ТипКузова.Наименование + "" ("" + АСМ_Модификации.КоличествоДверей.Наименование + "" дв.)"" КАК
				   |		Расшифровка
				   |ИЗ
				   |	Справочник.АСМ_Модификации КАК АСМ_Модификации
				   |ГДЕ
				   |	АСМ_Модификации.Модель = &Модель
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ИСТИНА КАК Совместимо,
				   |	АСМ_МодификацииКомплектации.Комплектация.Наименование КАК Наименование
				   |ИЗ
				   |	Справочник.АСМ_Модификации.Комплектации КАК АСМ_МодификацииКомплектации
				   |ГДЕ
				   |	АСМ_МодификацииКомплектации.Ссылка.Модель = &Модель
				   |;
				   |
				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ
				   |	АСМ_Поколения.Ссылка КАК Поколение
				   |ИЗ
				   |	Справочник.АСМ_Поколения КАК АСМ_Поколения
				   |ГДЕ
				   |	АСМ_Поколения.Модель = &Модель
				   |
				   |УПОРЯДОЧИТЬ ПО
				   |	АСМ_Поколения.Наименование";
	ПакетОпций = Запрос.ВыполнитьПакет();

	ОпцииОтбора.Вставить("Агрегаты", ПакетОпций[0].Выгрузить());
	ОпцииОтбора.Вставить("ТипыКузовов", ПакетОпций[1].Выгрузить());
	ОпцииОтбора.Вставить("Комплектации", ПакетОпций[2].Выгрузить());
	ОпцииОтбора.Вставить("Поколения", ПакетОпций[3].Выгрузить());

	Возврат ОпцииОтбора;

КонецФункции

// Находит элемент справочника по коду и наименованию.
// 
// Если отсутствует элемент справочника с заданным кодом и ИзменятьЭлемент = Истина - создает новый элемент
// Если наименование не соответствует заданному и ИзменятьЭлемент = Истина - производит переименование элемента
// 
// В случае неудачного поиска, создания или переименования элемента возвращает Неопределено
// 
// Параметры:
//  Код - Строка - Код
//  Наименование - Строка - Наименование
//  ИзменятьЭлемент - Булево - При необходимости изменять наименование или создавать новый элемент
//  СчетчикИзмененных - Число, Неопределено - Счетчик измененных элементов
// 
// Возвращаемое значение:
//  Неопределено, СправочникСсылка.АСМ_Марки - Найденный или созданный элемент
Функция НайтиПоКодуИНаименованию(ДанныеЗаполнения, ИзменятьЭлемент = Ложь, СчетчикИзмененных = Неопределено) Экспорт

	СправочникМенеджер = Справочники.АСМ_Модели;

	Ссылка = АСМ_КаталогВызовСервера.НайтиСоздатьПоКодуИНаименованию(СправочникМенеджер,
																	 ДанныеЗаполнения,
																	 ИзменятьЭлемент,
																	 СчетчикИзмененных);
	Возврат Ссылка;

КонецФункции

#КонецОбласти

#КонецЕсли
